# DoubleArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleArray Constructor
DoubleArray Class See Also
---
Initializes a new instance of the DoubleArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DoubleArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DoubleArray()
```

# See Also
DoubleArray Class
Autodesk.Revit.DB Namespace